/*
 * Set.h
 *
 * Created: 25.12.2011 23:27:26
 *  Author: Profile
 */ 


#ifndef SET_H_
#define SET_H_


#define EXECUTION_UNIT_SWITCH_ON 1
#define EXECUTION_UNIT_SWITCH_OFF 0


//--------------------------------------События и ошибки монетоприёмника---------------------//

#define COIN_ERROR						10
#define CHANGER_NO_CREDIT_ERROR			11	// Ошибка: Монета была принята, но не попала на своё место, когда кредит был начислен
#define CHANGER_DEF_TUBE_SENS_ERROR		12	// Ошибка: Монетник обнаружил, что один из сенсоров туб работает ненормально
#define CHANGER_UNPLUGGED_ERROR			13	// Ошибка: Монетник обнаружил, что он был отключен/перемещён 
#define CHANGER_TUBE_JAM_ERROR			14	// Ошибка: Застревание монет в тубе
#define CHANGER_ROM_ERROR				15	// Ошибка: Внутренняя ошибка памяти монетника
#define CHANGER_ROUTING_ERROR			16	// Ошибка: Монета принята, но не проследовала в назначенное место
#define CHANGER_COIN_JAM_ERROR			17	// Ошибка: Застревание монет в приёмном узле
#define CHANGER_BOX_FULL_EVENT			18	// Событие: денежный бокс заполнен--------------------------------------------------------------------------------------
#define CHANGER_CONNECT_ERROR			19	// Ошибка связи с монетником

//------------------------------------------События и ошибки банкнотоприёмника----------------//

#define BILL_CONNECT_ERROR					20	// Ошибка связи с банкнотоприёмником
#define BILL_DEFECTIVE_MOTOR_ERROR			21	// Ошибка: Проблемы с одним из моторов

#define WATER_OVERFLOW_EVENT		43	// Событие(ошибка): переполнения сливного бака--------------------------------------------------------------------------------
#define WATER_NEAR_FINISH_EVENT		46	// Событие: вода скоро закончится (только для отчёта)
#define WATER_FINISHED_EVENT		47	// Событие(ошибка): вода закончилась------------------------------------------------------------------------------------------

//----------------------------------События и ошибки сиропов----------------------------------//

#define SYRUP_1_FINISHED_EVENT		51	// Событие(ошибка): сироп #1 закончился--------------------------------------------------------------------------------------
#define SYRUP_2_FINISHED_EVENT		52	// Событие(ошибка): сироп #2 закончился--------------------------------------------------------------------------------------
#define SYRUP_3_FINISHED_EVENT		53	// Событие(ошибка): сироп #3 закончился--------------------------------------------------------------------------------------
#define SYRUP_4_FINISHED_EVENT		54	// Событие(ошибка): сироп #4 закончился--------------------------------------------------------------------------------------
#define SYRUP_5_FINISHED_EVENT		55	// Событие(ошибка): сироп #5 закончился--------------------------------------------------------------------------------------
#define SYRUP_NEAR_FINISH_EVENT		56	// Событие: сиропы заканчиваются (только для отчёта)
#define SYRUP_FINISHED_EVENT		57	// Событие(ошибка): сиропы закончились---------------------------------------------------------------------------------------

//----------------------------------Программные ошибки-----------------------------------------//

#define PR_QUEUECREATE_ERROR		61	// Программная ошибка. Ошибка создания очередей
#define MEM_SETLOADING_ERROR		62	// Ошибка загрузки настроек автомата
#define MEM_SHORTLOADING_ERROR		63	// Ошибка загрузки короткой бухгалтерии автомата
#define MEM_LONGLOADING_ERROR		64	// Ошибка загрузки длинной бухгалтерии автомата
#define MEM_BALANCELOADING_ERROR	65	// Ошибка загрузки баланса автомата

//----------------------------------Ошибки GSM-модема-----------------------------------------//

#define GSM_CONNECTION_ERROR		71	// Ошибка: нет связи с модемом (модем не отвечает)
#define GSM_NETWORK_ERROR			72	// Ошибка: сеть не найдена


#define DOOR_OPENED_EVENT			101	// Событие открытия двери
#define DOOR_CLOSED_EVENT			102	// Событие закрытия двери

#define POWER_ON_EVENT				111	// Включение автомата
#define POWER_OFF_EVENT				112	// Выключение автомата (записывается в память после включения и проверки времени последней записи в память)

#define STAT_ENTER_EVENT			121	// Событие входа в инкассацию
#define SHORT_STAT_CLEAR_EVENT		122	// Событие обнуления короткой бухгалтерии
#define PRODUCTS_RELOAD_EVENT		123	// Событие загрузка товаров
//-------------------------------------------------------------------------------------------------------------------------------------------------------------------//

typedef struct
{
	uint8_t ERRORSTATE_1_8:8;
	//---
	uint8_t ERRORSTATE_9:1;
	uint8_t ERRORSTATE_COIN_ERROR:1;						//	10
	uint8_t ERRORSTATE_CHANGER_NO_CREDIT_ERROR:1;			//	11	// Ошибка: Монета была принята, но не попала на своё место, когда кредит был начислен
	uint8_t ERRORSTATE_CHANGER_DEF_TUBE_SENS_ERROR:1;		//	12	// Ошибка: Монетник обнаружил, что один из сенсоров туб работает ненормально
	uint8_t ERRORSTATE_CHANGER_UNPLUGGED_ERROR:1;			//	13	// Ошибка: Монетник обнаружил, что он был отключен/перемещён 
	uint8_t ERRORSTATE_CHANGER_TUBE_JAM_ERROR:1;			//	14	// Ошибка: Застревание монет в тубе
	uint8_t ERRORSTATE_CHANGER_ROM_ERROR:1;					//	15	// Ошибка: Внутренняя ошибка памяти монетника
	uint8_t ERRORSTATE_CHANGER_ROUTING_ERROR:1;				//	16	// Ошибка: Монета принята, но не проследовала в назначенное место
	//---
	uint8_t ERRORSTATE_CHANGER_COIN_JAM_ERROR:1;			//	17	// Ошибка: Застревание монет в приёмном узле
	uint8_t ERRORSTATE_CHANGER_BOX_FULL_EVENT:1;			//	18	// Событие: денежный бокс заполнен--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_CHANGER_CONNECT_ERROR:1;				//	19	// Ошибка связи с монетником
	

//------------------------------------------События и ошибки банкнотоприёмника----------------//
	uint8_t ERRORSTATE_BILL_CONNECT_ERROR:1;				//	20	// Ошибка связи с банкнотоприёмником							//	20
	uint8_t ERRORSTATE_BILL_DEFECTIVE_MOTOR_ERROR:1;		//	21	// Ошибка: Проблемы с одним из моторов
	uint8_t ERRORSTATE_BILL_SENSOR_PROBLEM_ERROR:1;			//	22	// Ошибка: Проблемы с одним из оптических датчиков
	uint8_t ERRORSTATE_BILL_ROM_ERROR:1;					//	23	// Ошибка: Ошибка контрольной суммы внутренней памяти монетника
	uint8_t ERRORSTATE_BILL_VALIDATOR_JAMMED_ERROR:1;		//	24	// Ошибка: Застревание купюры в приёмном узле
	//---
	uint8_t ERRORSTATE_BILL_BILL_REMOVED_ERROR:1;			//	25	// Ошибка: Извлечение купюры в положении удержания купюры
	uint8_t ERRORSTATE_BILL_CASH_BOX_ERROR:1;				//	26	// Ошибка: Отсоединение cashbox
	uint8_t ERRORSTATE_BILL_CREDITED_BILL_REMOVED_ERROR:1;	//	27	// Ошибка: Извлечение купюры после того как она была принята и уложена в стакере
	uint8_t ERRORSTATE_BILL_CASHBOX_NEAR_FULL_EVENT:1;		//	28	// Событие: бокс с купюрами почти наполнен---------------------------------------------------------------------------------
	uint8_t ERRORSTATE_BILL_CASHBOX_FULL_EVENT:1;			//	29	// Событие: бокс с купюрами наполнен
	uint8_t ERRORSTATE_30:1;								//	30

//----------------------------------События и ошибки стаканоотщепителя------------------------//

	uint8_t ERRORSTATE_CUPDISP_SENSOR_ERROR:1;		//	31	// Ошибка датчиков отщепителя стаканов
	uint8_t ERRORSTATE_CUP_NOCUP_INTIME_ERROR:1;	//	32	// Ошибка выдачи стакана (если в отведённое время не сработал датчик наличия стакана) ----------------------------------------
	//---
	uint8_t ERRORSTATE_CUP_NOCUP_ERROR:1;			//	33	// Ошибка выдачи стакана (стаканы закончились)--------------------------------------------------------------------------------
	uint8_t ERRORSTATE_CUP_DISPROTSENS_ERROR:1;		//	34	// Ошибка датчиков отщепителя при выдаче стакана -----------------------------------------------------------------------------
	uint8_t ERRORSTATE_CUP_CAPASROTSENS_ERROR:1;	//	35	// Ошибка датчиков при повороте ёмкости со стаканами--------------------------------------------------------------------------
	uint8_t ERRORSTATE_CUP_NEAR_FINISH_EVENT:1;		//	36	// Событие: стаканы заканчиваются (только для отчёта)
	uint8_t ERRORSTATE_CUP_FINISHED_EVENT:1;		//	37	// Событие(ошибка): Стаканы закончились---------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_38:1;						//	38
	uint8_t ERRORSTATE_39:1;						//	39
	uint8_t ERRORSTATE_40:1;						//	40
	//---
//----------------------------------События и ошибки, связанные с водой-----------------------//

	uint8_t ERRORSTATE_WPUMP_PUMP_ERROR:1;			//	41	// Ошибка насоса высокого давления (если за отведённое время работы насоса не сработал датчик верхнего уровня)----------------
	uint8_t ERRORSTATE_WATER_FLOWSENS_ERROR:1;		//	42	// Ошибка: нетсигнала с датчика расхода воды. Возможно нет воды.
	uint8_t ERRORSTATE_WATER_OVERFLOW_EVENT:1;		//	43	// Событие(ошибка): переполнения сливного бака--------------------------------------------------------------------------------
	uint8_t ERRORSTATE_44:1;						//	44
	uint8_t ERRORSTATE_45:1;						//	45
	uint8_t ERRORSTATE_WATER_NEAR_FINISH_EVENT:1;	//	46	// Событие: вода скоро закончится (только для отчёта)
	uint8_t ERRORSTATE_WATER_FINISHED_EVENT:1;		//	47	// Событие(ошибка): вода закончилась------------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_48:1;						//	48
	//---
	uint8_t ERRORSTATE_49:1;						//	49
	uint8_t ERRORSTATE_50:1;						//	50

//----------------------------------События и ошибки сиропов----------------------------------//

	uint8_t ERRORSTATE_SYRUP_1_FINISHED_EVENT:1;	//  51	// Событие(ошибка): сироп #1 закончился--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_SYRUP_2_FINISHED_EVENT:1;	//	52	// Событие(ошибка): сироп #2 закончился--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_SYRUP_3_FINISHED_EVENT:1;	//	53	// Событие(ошибка): сироп #3 закончился--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_SYRUP_4_FINISHED_EVENT:1;	//	54	// Событие(ошибка): сироп #4 закончился--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_SYRUP_5_FINISHED_EVENT:1;	//	55	// Событие(ошибка): сироп #5 закончился--------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_SYRUP_NEAR_FINISH_EVENT:1;	//	56	// Событие: сиропы заканчиваются (только для отчёта)
	//---
	uint8_t ERRORSTATE_SYRUP_FINISHED_EVENT:1;		//	57	// Событие(ошибка): сиропы закончились---------------------------------------------------------------------------------------
	uint8_t ERRORSTATE_58:1;						//	58
	uint8_t ERRORSTATE_59:1;						//	59
	uint8_t ERRORSTATE_60:1;						//	60
//----------------------------------Программные ошибки-----------------------------------------//

	uint8_t ERRORSTATE_PR_QUEUECREATE_ERROR:1;		//	61	// Программная ошибка. Ошибка создания очередей
	uint8_t ERRORSTATE_MEM_SETLOADING_ERROR:1;		//	62	// Ошибка загрузки настроек автомата
	uint8_t ERRORSTATE_MEM_SHORTLOADING_ERROR:1;	//	63	// Ошибка загрузки короткой бухгалтерии автомата
	uint8_t ERRORSTATE_MEM_LONGLOADING_ERROR:1;		//	64	// Ошибка загрузки длинной бухгалтерии автомата
	//---
	uint8_t ERRORSTATE_MEM_BALANCELOADING_ERROR:1;	//	65	// Ошибка загрузки баланса автомата
	uint8_t ERRORSTATE_66:1;						//	66
	uint8_t ERRORSTATE_67:1;						//	67
	uint8_t ERRORSTATE_68:1;						//	68
	uint8_t ERRORSTATE_69:1;						//	69
	uint8_t ERRORSTATE_70:1;						//	70

//----------------------------------Ошибки GSM-модема-----------------------------------------//

	uint8_t ERRORSTATE_GSM_CONNECTION_ERROR:1;	//	71	// Ошибка: нет связи с модемом (модем не отвечает)
	uint8_t ERRORSTATE_GSM_NETWORK_ERROR:1;		//	72	// Ошибка: сеть не найдена
	//---
	uint8_t ERRORSTATE_73_80:8;					//	73...80
	uint8_t ERRORSTATE_81_88:8;					//	81...88
	uint8_t ERRORSTATE_89_96:8;					//	89...96
	//---
	uint8_t ERRORSTATE_97:1;					//	97
	uint8_t ERRORSTATE_98:1;					//	98
	uint8_t ERRORSTATE_99:1;					//	99
	uint8_t ERRORSTATE_100:1;					//	100
	uint8_t ERRORSTATE_DOOR_OPENED_EVENT:1;		//	101	// Событие открытия двери
	uint8_t ERRORSTATE_DOOR_CLOSED_EVENT:1;		//	102	// Событие закрытия двери
	uint8_t ERRORSTATE_103:1;					//	103
	uint8_t ERRORSTATE_104:1;					//	104
	//---
	uint8_t ERRORSTATE_105:1;					//	105
	uint8_t ERRORSTATE_106:1;					//	106
	uint8_t ERRORSTATE_107:1;					//	107
	uint8_t ERRORSTATE_108:1;					//	108
	uint8_t ERRORSTATE_109:1;					//	109
	uint8_t ERRORSTATE_110:1;					//	110
	uint8_t ERRORSTATE_POWER_ON_EVENT:1;		//	111	// Включение автомата
	uint8_t ERRORSTATE_POWER_OFF_EVENT:1;		//	112	// Выключение автомата (записывается в память после включения и проверки времени последней записи в память)
	//---
	uint8_t ERRORSTATE_113_120:8;					//	113...120
	//---
	uint8_t ERRORSTATE_STAT_ENTER_EVENT:1;			//	121	// Событие входа в инкассацию
	uint8_t ERRORSTATE_SHORT_STAT_CLEAR_EVENT:1;	//	122	// Событие обнуления короткой бухгалтерии
	uint8_t ERRORSTATE_PRODUCTS_RELOAD_EVENT:1;		//	123	// Событие загрузка товаров
	uint8_t ERRORSTATE_124:1;						//	124
	uint8_t ERRORSTATE_125:1;						//	125
	uint8_t ERRORSTATE_126:1;						//	126
	uint8_t ERRORSTATE_127:1;						//	127
	uint8_t ERRORSTATE_128:1;						//	128
	//---
	uint8_t ERRORSTATE_129_136:8;					//	129...136
	uint8_t ERRORSTATE_137_144:8;					//	137...144
	uint8_t ERRORSTATE_145_152:8;					//	145...152
	uint8_t ERRORSTATE_153_160:8;					//	153...160
	uint8_t ERRORSTATE_161_168:8;					//	161...168
	uint8_t ERRORSTATE_169_176:8;					//	169...176
	uint8_t ERRORSTATE_177_184:8;					//	177...184
	uint8_t ERRORSTATE_185_192:8;					//	185...192
	uint8_t ERRORSTATE_193_200:8;					//	193...200
	uint8_t ERRORSTATE_201_208:8;					//	201...208
	uint8_t ERRORSTATE_209_216:8;					//	209...216
	uint8_t ERRORSTATE_217_224:8;					//	217...224
	uint8_t ERRORSTATE_225_232:8;					//	225...232
	uint8_t ERRORSTATE_233_240:8;					//	233...240
	uint8_t ERRORSTATE_241_248:8;					//	241...248
	uint8_t ERRORSTATE_249_256:8;					//	249...256
}Errors_state_t;

/*
// Отправлять СМС при аварии
		uint16_t Report_encashment_SMS_Enable:1;				// Отправлять СМС при инкассации
